In [1]:
import numpy as np
import pandas as pd

#### pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
One-dimensional ndarray with axis labels

In [2]:
scores = {'Chinese': 75, 'English': 86, 'Math': 91}
obj1 = pd.Series(scores)
obj1.name = 'Student_1'
obj1

Chinese    75
English    86
Math       91
Name: Student_1, dtype: int64

In [3]:
obj2 = pd.Series({'Chinese': 82.5, 'English': 67, 'Science': 78}, name='Student_2')
obj2

Chinese    82.5
English    67.0
Science    78.0
Name: Student_2, dtype: float64

In [4]:
obj3 = obj1 + obj2
obj3

Chinese    157.5
English    153.0
Math         NaN
Science      NaN
dtype: float64

In [5]:
obj3.isnull()

Chinese    False
English    False
Math        True
Science     True
dtype: bool

In [6]:
obj3.notnull()

Chinese     True
English     True
Math       False
Science    False
dtype: bool

#### pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects.

In [7]:
df = pd.DataFrame([obj1, obj2])
print(f'columns = {df.columns}')
print(f'index = {df.index}')
df

columns = Index(['Chinese', 'English', 'Math', 'Science'], dtype='object')
index = Index(['Student_1', 'Student_2'], dtype='object')

           Chinese  English  Math  Science
Student_1     75.0     86.0  91.0      NaN
Student_2     82.5     67.0   NaN     78.0

In [8]:
df = pd.DataFrame({
    'Student_1': [75.0, 86.0, 91.0, None],
    'Student_2': [82.5, 67.0, None, 78.0],
    'Student_3': [69.0, 75.0, 83.0, 64.0],},
    index=['Chinese', 'English', 'Math', 'Science']
)
print(f'columns = {df.columns}')
print(f'index = {df.index}')
df

columns = Index(['Student_1', 'Student_2', 'Student_3'], dtype='object')
index = Index(['Chinese', 'English', 'Math', 'Science'], dtype='object')

         Student_1  Student_2  Student_3
Chinese       75.0       82.5       69.0
English       86.0       67.0       75.0
Math          91.0        NaN       83.0
Science        NaN       78.0       64.0

In [9]:
df = pd.DataFrame({
    'Chinese': [75.0, 82.5, 69.0],
    'English': [86.0, 67.0, 75.0],
    'Math': [91.0, None, 83.0],
    'Science': [None, 78.0, 64.0]},
    index=['Student_1', 'Student_2', 'Student_3']
)
print(f'columns = {df.columns}')
print(f'index = {df.index}')
df

columns = Index(['Chinese', 'English', 'Math', 'Science'], dtype='object')
index = Index(['Student_1', 'Student_2', 'Student_3'], dtype='object')

           Chinese  English  Math  Science
Student_1     75.0     86.0  91.0      NaN
Student_2     82.5     67.0   NaN     78.0
Student_3     69.0     75.0  83.0     64.0

In [10]:
df = pd.DataFrame([
    [75.0, 86.0, 91.0, None],
    [82.5, 67.0, None, 78.0],
    [69.0, 75.0, 83.0, 64.0]],
    columns=['Chinese', 'English', 'Math', 'Science'],
    index=['Student_1', 'Student_2', 'Student_3']
)
print(f'columns = {df.columns}')
print(f'index = {df.index}')
df

columns = Index(['Chinese', 'English', 'Math', 'Science'], dtype='object')
index = Index(['Student_1', 'Student_2', 'Student_3'], dtype='object')

           Chinese  English  Math  Science
Student_1     75.0     86.0  91.0      NaN
Student_2     82.5     67.0   NaN     78.0
Student_3     69.0     75.0  83.0     64.0

In [11]:
print(f'type(df.Chinese) = {type(df.Chinese)}\n')
print(df.Chinese, '\n')
print(df['Chinese'])

type(df.Chinese) = <class 'pandas.core.series.Series'>

Student_1    75.0
Student_2    82.5
Student_3    69.0
Name: Chinese, dtype: float64

Student_1    75.0
Student_2    82.5
Student_3    69.0
Name: Chinese, dtype: float64

#### DataFrame.T
Transpose index and columns.

In [12]:
df.T

         Student_1  Student_2  Student_3
Chinese       75.0       82.5       69.0
English       86.0       67.0       75.0
Math          91.0        NaN       83.0
Science        NaN       78.0       64.0

#### pandas.DataFrame.loc
Access a group of rows and columns by label(s) or a boolean array.

.loc[ ] is primarily label based, but may also be used with a boolean array.

In [13]:
print(df.Chinese, '\n')

print(df.loc['Student_1'], '\n')
print(df.loc['Student_1', 'Chinese'])
print(df.loc['Student_1']['Chinese'], '\n')

# Attention: column-'Math' included
print(df.loc['Student_1']['Chinese':'Math'])

Student_1    75.0
Student_2    82.5
Student_3    69.0
Name: Chinese, dtype: float64

Chinese    75.0
English    86.0
Math       91.0
Science     NaN
Name: Student_1, dtype: float64

75.0
75.0

Chinese    75.0
English    86.0
Math       91.0
Name: Student_1, dtype: float64

#### DataFrame.iloc
Purely integer-location based indexing for selection by position.

In [14]:
print(df.iloc[0], '\n')
print(df.iloc[0, 0])
print(df.iloc[0][0], '\n')

# Attention: index-2 not included
print(df.iloc[0][0:2])

Chinese    75.0
English    86.0
Math       91.0
Science     NaN
Name: Student_1, dtype: float64

75.0
75.0

Chinese    75.0
English    86.0
Name: Student_1, dtype: float64

In [15]:
df2 = df.copy()
df2['Music'] = [100, 90, 95]
df2

           Chinese  English  Math  Science  Music
Student_1     75.0     86.0  91.0      NaN    100
Student_2     82.5     67.0   NaN     78.0     90
Student_3     69.0     75.0  83.0     64.0     95

In [16]:
del df2['Chinese']
df2

           English  Math  Science  Music
Student_1     86.0  91.0      NaN    100
Student_2     67.0   NaN     78.0     90
Student_3     75.0  83.0     64.0     95

#### DataFrame.reindex(labels=None, index=None, columns=None, axis=None, method=None, copy=True, level=None, fill_value=nan, limit=None, tolerance=None)
Conform DataFrame to new index with optional filling logic, placing NA/NaN in locations having no value in the previous index. A new object is produced unless the new index is equivalent to the current one and copy=False

In [17]:
df2 = df2.reindex(['Student_0', 'Student_2', 'Student_3', 'Student_1'])
df2

           English  Math  Science  Music
Student_0      NaN   NaN      NaN    NaN
Student_2     67.0   NaN     78.0   90.0
Student_3     75.0  83.0     64.0   95.0
Student_1     86.0  91.0      NaN  100.0

In [18]:
df2.index

Index(['Student_0', 'Student_2', 'Student_3', 'Student_1'], dtype='object')

In [19]:
df2.index = [0, 2, 3, 1]
df2

   English  Math  Science  Music
0      NaN   NaN      NaN    NaN
2     67.0   NaN     78.0   90.0
3     75.0  83.0     64.0   95.0
1     86.0  91.0      NaN  100.0

In [20]:
df2.columns = ['EN', 'MA', 'SC', 'MU']
df2

     EN    MA    SC     MU
0   NaN   NaN   NaN    NaN
2  67.0   NaN  78.0   90.0
3  75.0  83.0  64.0   95.0
1  86.0  91.0   NaN  100.0

In [21]:
values = df2.values
print(f'type(values) = {type(values)}')
values

type(values) = <class 'numpy.ndarray'>

array([[ nan,  nan,  nan,  nan],
       [ 67.,  nan,  78.,  90.],
       [ 75.,  83.,  64.,  95.],
       [ 86.,  91.,  nan, 100.]])

In [22]:
# df2 is a copy of df
# changing the value in df2 will not change df
df

           Chinese  English  Math  Science
Student_1     75.0     86.0  91.0      NaN
Student_2     82.5     67.0   NaN     78.0
Student_3     69.0     75.0  83.0     64.0

In [23]:
# insert a new column
df['ID'] = [i.split('_')[1] for i in df.index]
df

           Chinese  English  Math  Science ID
Student_1     75.0     86.0  91.0      NaN  1
Student_2     82.5     67.0   NaN     78.0  2
Student_3     69.0     75.0  83.0     64.0  3

In [24]:
# rearrange columns in a data frame
df = df[['ID', 'Chinese', 'English', 'Math', 'Science']]
df

          ID  Chinese  English  Math  Science
Student_1  1     75.0     86.0  91.0      NaN
Student_2  2     82.5     67.0   NaN     78.0
Student_3  3     69.0     75.0  83.0     64.0

#### DataFrame.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)
Set the DataFrame index (row labels) using one or more existing columns. By default yields a new object.

In [25]:
df = df.set_index('ID')
df

    Chinese  English  Math  Science
ID
1      75.0     86.0  91.0      NaN
2      82.5     67.0   NaN     78.0
3      69.0     75.0  83.0     64.0

#### DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
Drop specified labels from rows or columns.

In [26]:
# df.drop() is not an inplace operation
df.drop(['Chinese', 'English'], axis=1)

    Math  Science
ID
1   91.0      NaN
2    NaN     78.0
3   83.0     64.0

#### DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Remove missing values.

In [27]:
df.dropna(how='all')

    Chinese  English  Math  Science
ID
1      75.0     86.0  91.0      NaN
2      82.5     67.0   NaN     78.0
3      69.0     75.0  83.0     64.0

In [28]:
df2 = df.copy()
df2.loc['Avg'] = round(df.mean(axis=0), 1)
df2

     Chinese  English  Math  Science
ID
1       75.0     86.0  91.0      NaN
2       82.5     67.0   NaN     78.0
3       69.0     75.0  83.0     64.0
Avg     75.5     76.0  87.0     71.0

In [29]:
df2['Sum'] = df2.sum(axis=1)
df2['Avg'] = df2.loc[:, 'Chinese': 'Science'].mean(axis=1)
df2

     Chinese  English  Math  Science    Sum        Avg
ID
1       75.0     86.0  91.0      NaN  252.0  84.000000
2       82.5     67.0   NaN     78.0  227.5  75.833333
3       69.0     75.0  83.0     64.0  291.0  72.750000
Avg     75.5     76.0  87.0     71.0  309.5  77.375000

In [30]:
df3 = df2.drop('Avg', axis=0)
df4 = df3.sort_values(by=['Avg', 'Chinese'], ascending=True)
df4

    Chinese  English  Math  Science    Sum        Avg
ID
3      69.0     75.0  83.0     64.0  291.0  72.750000
2      82.5     67.0   NaN     78.0  227.5  75.833333
1      75.0     86.0  91.0      NaN  252.0  84.000000

#### DataFrame.sort_index(axis=0, level=None, ascending=True, inplace=False, kind='quicksort', na_position='last', sort_remaining=True, by=None)
Sort object by labels (along an axis)

In [31]:
df4.sort_index(axis=0)

    Chinese  English  Math  Science    Sum        Avg
ID
1      75.0     86.0  91.0      NaN  252.0  84.000000
2      82.5     67.0   NaN     78.0  227.5  75.833333
3      69.0     75.0  83.0     64.0  291.0  72.750000

In [32]:
df4.sort_index(axis=1)

          Avg  Chinese  English  Math  Science    Sum
ID
3   72.750000     69.0     75.0  83.0     64.0  291.0
2   75.833333     82.5     67.0   NaN     78.0  227.5
1   84.000000     75.0     86.0  91.0      NaN  252.0

#### DataFrame.rank(axis=0, method='average', numeric_only=None, na_option='keep', ascending=True, pct=False)
Compute numerical data ranks (1 through n) along axis. Equal values are assigned a rank that is the average of the ranks of those values

In [33]:
df3.rank(axis=0, ascending=False)

    Chinese  English  Math  Science  Sum  Avg
ID
1       2.0      1.0   1.0      NaN  2.0  1.0
2       1.0      3.0   NaN      1.0  3.0  2.0
3       3.0      2.0   2.0      2.0  1.0  3.0

#### DataFrame.idxmax(axis=0, skipna=True)
Return index of first occurrence of maximum over requested axis. NA/null values are excluded.

In [34]:
df3.index = ['Ann', 'Bob', 'Claire']
df3

        Chinese  English  Math  Science    Sum        Avg
Ann        75.0     86.0  91.0      NaN  252.0  84.000000
Bob        82.5     67.0   NaN     78.0  227.5  75.833333
Claire     69.0     75.0  83.0     64.0  291.0  72.750000

In [35]:
df3.idxmax()

Chinese       Bob
English       Ann
Math          Ann
Science       Bob
Sum        Claire
Avg           Ann
dtype: object

In [36]:
df3.idxmin()

Chinese    Claire
English       Bob
Math       Claire
Science    Claire
Sum           Bob
Avg        Claire
dtype: object

In [37]:
df3.cumsum()

        Chinese  English   Math  Science    Sum         Avg
Ann        75.0     86.0   91.0      NaN  252.0   84.000000
Bob       157.5    153.0    NaN     78.0  479.5  159.833333
Claire    226.5    228.0  174.0    142.0  770.5  232.583333

#### DataFrame.apply(func, axis=0, broadcast=False, raw=False, reduce=None, args=(), **kwds)
Applies function along input axis of DataFrame.

In [38]:
df = pd.DataFrame({
    'Student_1': [75.0, 86.0, 91.0, None],
    'Student_2': [82.5, 67.0, None, 78.0],
    'Student_3': [69.0, 75.0, 83.0, 64.0],},
    index=['Chinese', 'English', 'Math', 'Science']
)
df

         Student_1  Student_2  Student_3
Chinese       75.0       82.5       69.0
English       86.0       67.0       75.0
Math          91.0        NaN       83.0
Science        NaN       78.0       64.0

In [39]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

df.apply(f, axis=0)

     Student_1  Student_2  Student_3
min       75.0       67.0       64.0
max       91.0       82.5       83.0

In [40]:
df.apply(f, axis=1)

          min   max
Chinese  69.0  82.5
English  67.0  86.0
Math     83.0  91.0
Science  64.0  78.0

#### DataFrame.applymap(func)
Apply a function to a Dataframe <font color="red">elementwise</font>.

This method applies a function that accepts and returns a scalar to every element of a DataFrame.

In [41]:
f = lambda x: 0 if pd.isnull(x) else int(x)
df = df.applymap(f)
df

         Student_1  Student_2  Student_3
Chinese         75         82         69
English         86         67         75
Math            91          0         83
Science          0         78         64

#### DataFrame.describe(percentiles=None, include=None, exclude=None)
Generates descriptive statistics that summarize the central tendency, dispersion and shape of a datasets distribution, excluding NaN values.

Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types. The output will vary depending on what is provided. Refer to the notes below for more detail.

In [42]:
from sklearn.datasets import load_iris
iris = load_iris()
type(iris)

sklearn.utils.Bunch

In [43]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [44]:
from sklearn.datasets import load_iris
iris = load_iris()
df = pd.DataFrame(iris.data, columns=iris.feature_names)
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [45]:
df.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

#### DataFrame.cov(min_periods=None)
Compute pairwise covariance of columns, excluding NA/null values.


$ cov(X, Y) = E[(X - E[X]) (Y - E[Y])]$

In [46]:
df.cov()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
sepal length (cm),0.685694,-0.042434,1.274315,0.516271
sepal width (cm),-0.042434,0.189979,-0.329656,-0.121639
petal length (cm),1.274315,-0.329656,3.116278,1.295609
petal width (cm),0.516271,-0.121639,1.295609,0.581006

#### DataFrame.corr(method='pearson', min_periods=1)
Compute pairwise correlation of columns, excluding NA/null values

$ corr(X, Y) = \frac{cov(X, Y)}{\sigma_{X} \sigma_{Y}} $

In [47]:
df.corr()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
sepal length (cm),1.000000,-0.117570,0.871754,0.817941
sepal width (cm),-0.117570,1.000000,-0.428440,-0.366126
petal length (cm),0.871754,-0.428440,1.000000,0.962865
petal width (cm),0.817941,-0.366126,0.962865,1.000000

In [48]:
df = pd.DataFrame({
    'a': np.random.randint(1, 5, 5),
    'b': np.random.randint(1, 5, 5),
    'c': np.random.randint(1, 5, 5),
})

df

   a  b  c
0  2  4  3
1  4  3  3
2  3  3  3
3  1  1  1
4  3  2  3

#### Series.unique()
Return unique values of Series object.

In [49]:
df['c'].unique()

array([3, 1])

#### Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)
Returns object containing counts of unique values.

In [50]:
df['a'].value_counts(sort=False)

1    1
2    1
3    2
4    1
Name: a, dtype: int64

#### DataFrame.isin(values)
Return boolean DataFrame showing whether each element in the DataFrame is contained in values.

In [51]:
df.isin([1, 2])

       a      b      c
0   True  False  False
1  False  False  False
2  False  False  False
3   True   True   True
4  False   True  False

In [52]:
mask = df['a'].isin([1, 2])
df[mask]

   a  b  c
0  2  4  3
3  1  1  1

#### Index.get_indexer(target, method=None, limit=None, tolerance=None)
Compute indexer and mask for new index given the current index.

In [53]:
df.index = ['III', 'I', 'II', 'I', 'III']
df

     a  b  c
III  2  4  3
I    4  3  3
II   3  3  3
I    1  1  1
III  3  2  3

In [54]:
old_index = df.index
new_index = pd.Series(['I', 'II', 'III'])
df.index = pd.Index(new_index).get_indexer(old_index)
df

   a  b  c
2  2  4  3
0  4  3  3
1  3  3  3
0  1  1  1
2  3  2  3

In [55]:
df = pd.DataFrame({
    'a': np.random.randint(1, 5, 5),
    'b': np.random.randint(1, 5, 5),
    'c': np.random.randint(1, 5, 5),
})
f = lambda x: x if x != 4 else None
df = df.applymap(f)
df

     a  b    c
0  3.0  3  NaN
1  2.0  3  3.0
2  NaN  1  1.0
3  NaN  3  NaN
4  2.0  2  3.0

In [56]:
df.apply(pd.value_counts)

       a  b    c
1.0  NaN  1  1.0
2.0  2.0  1  NaN
3.0  1.0  3  2.0

In [57]:
df.apply(pd.value_counts).fillna(0)

       a  b    c
1.0  0.0  1  1.0
2.0  2.0  1  0.0
3.0  1.0  3  2.0